[
    {
      "bookId": 1,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/wCNW20Z/1.jpg",
      "review": "The Great Gatsby, penned by F. Scott Fitzgerald, stands as a timeless classic that delves deep into the decadence and disillusionment of the Jazz Age. Set against the vibrant backdrop of 1920s America, the novel offers a poignant exploration of the American Dream and its elusive nature. Through the enigmatic protagonist, Jay Gatsby, Fitzgerald navigates themes of love, wealth, and the pursuit of happiness, weaving a narrative that captivates readers from start to finish. With its rich symbolism, vivid characters, and lyrical prose, The Great Gatsby continues to resonate with audiences, serving as a poignant reminder of the complexities of human desires and the consequences of unchecked ambition.",
      "totalPages": 180,
      "rating": 4.2,
      "category": "Fiction",
      "tags": ["Classic", "Romance"],
      "publisher": "Charles Scribner's Sons",
      "yearOfPublishing": 1925
    },
    {
      "bookId": 2,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/mbkXqqk/2.jpg",
      "review": "Harper Lee's To Kill a Mockingbird is a literary masterpiece that tackles profound themes of racial injustice and moral growth in the American South. Through the eyes of young Scout Finch, readers are transported to the fictional town of Maycomb, Alabama, where she grapples with the complexities of prejudice and compassion. Atticus Finch, Scout's father, emerges as a beacon of integrity and empathy as he defends a wrongly accused African American man in a racially charged trial. Lee's evocative prose and insightful portrayal of societal norms make this novel a timeless classic that continues to resonate with readers, sparking important conversations about equality and empathy.",
      "totalPages": 336,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Drama", "Social Justice"],
      "publisher": "J.B. Lippincott & Co.",
      "yearOfPublishing": 1960
    },
    {
      "bookId": 3,
      "bookName": "1984",
      "author": "George Orwell",
      "image": "https://i.ibb.co/yXCdR9C/3.jpg",
      "review": "George Orwell's dystopian masterpiece, 1984, paints a chilling portrait of a totalitarian society where individuality is suppressed and truth is manipulated. Set in a world of perpetual war and omnipresent surveillance, the novel follows Winston Smith, a disillusioned member of the ruling Party who dares to rebel against its oppressive regime. Through Winston's journey of resistance and rebellion, Orwell explores themes of censorship, propaganda, and the power of language to control thought. With its haunting portrayal of a bleak future, 1984 remains a cautionary tale that warns against the dangers of unchecked government control and serves as a stark reminder of the fragility of freedom.",
      "totalPages": 328,
      "rating": 4.5,
      "category": "Science Fiction",
      "tags": ["Dystopia", "Political"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "bookId": 4,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/PrrfvcN/4.jpg",
      "review": "Jane Austen's Pride and Prejudice is a sparkling comedy of manners that continues to captivate readers with its wit, charm, and timeless romance. Set in early 19th-century England, the novel follows the spirited Elizabeth Bennet as she navigates the intricacies of love and societal expectations. At its heart is the tumultuous relationship between Elizabeth and the enigmatic Mr. Darcy, whose initial pride and prejudice give way to a profound and enduring love. Austen's keen observations of human nature, coupled with her sharp social commentary, make this novel a beloved classic that transcends time and cultural boundaries.",
      "totalPages": 279,
      "rating": 4.4,
      "category": "Classic",
      "tags": ["Romance", "Satire"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
    },
    {
      "bookId": 5,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/PTgJKvP/5.jpg",
      "review": "J.D. Salinger's The Catcher in the Rye is a poignant coming-of-age novel that resonates with readers for its raw portrayal of teenage angst and alienation. Narrated by the disillusioned teenager Holden Caulfield, the novel follows his journey of self-discovery as he grapples with the phoniness of the adult world. Through Holden's candid voice and sharp observations, Salinger captures the essence of adolescence with honesty and empathy. The novel's themes of innocence, identity, and the search for authenticity continue to strike a chord with readers of all generations, making it a timeless classic that remains as relevant today as it was upon its publication.",
      "totalPages": 277,
      "rating": 4.3,
      "category": "Fiction",
      "tags": ["Coming-of-Age", "American Literature"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "bookId": 6,
      "bookName": "Moby-Dick",
      "author": "Herman Melville",
      "image": "https://i.ibb.co/wRkzq3x/6.jpg",
      "review": "Herman Melville's Moby-Dick is an epic adventure tale that explores the depths of obsession, fate, and the nature of humanity. Set against the backdrop of 19th-century whaling, the novel follows the enigmatic Captain Ahab as he seeks revenge on the elusive white whale, Moby Dick, who took his leg. Through Ahab's relentless pursuit and the crew's harrowing journey, Melville delves into themes of hubris, morality, and the struggle between man and nature. With its rich symbolism, philosophical depth, and lyrical prose, Moby-Dick stands as a towering achievement in American literature, captivating readers with its timeless exploration of the human condition.",
      "totalPages": 624,
      "rating": 4.1,
      "category": "Adventure",
      "tags": ["Whaling", "Symbolism"],
      "publisher": "Harper & Brothers",
      "yearOfPublishing": 1851
    },
    {
      "bookId": 7,
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/LnQh4Z1/7.jpg",
      "review": "J.R.R. Tolkien's The Hobbit is a delightful journey through Middle-earth that enchants readers with its whimsical charm, captivating adventure, and timeless themes of friendship and courage. The story follows Bilbo Baggins, a hobbit who is unexpectedly swept into an epic quest to reclaim the lost Dwarf Kingdom of Erebor from the fearsome dragon Smaug. Along the way, Bilbo encounters a colorful cast of characters, including the wise wizard Gandalf and the band of dwarves led by Thorin Oakenshield. Through thrilling battles, narrow escapes, and encounters with fantastical creatures, Bilbo discovers courage he never knew he possessed and learns the true meaning of heroism. With its vivid imagery, rich mythology, and unforgettable characters, The Hobbit is a beloved classic that continues to capture the hearts and imaginations of readers of all ages.",
      "totalPages": 310,
      "rating": 4.7,
      "category": "Fantasy",
      "tags": ["Adventure", "Middle-earth"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1937
    },
    {
      "bookId": 8,
      "bookName": "The Alchemist",
      "author": "Paulo Coelho",
      "image": "https://i.ibb.co/y6ngMtH/8.jpg",
      "review": "Paulo Coelho's The Alchemist is a timeless tale of self-discovery, destiny, and the pursuit of one's dreams. Set in exotic locales spanning from Spain to Egypt, the novel follows Santiago, a young shepherd who embarks on a quest to find his Personal Legend, or true purpose in life. Along the way, Santiago encounters a series of mentors, omens, and challenges that test his courage and resilience. Through his journey, Santiago learns valuable lessons about following his heart, embracing the unknown, and trusting in the universe's wisdom. With its profound insights and poetic prose, The Alchemist inspires readers to listen to their inner voice, pursue their dreams fearlessly, and seize the extraordinary opportunities that life presents.",
      "totalPages": 197,
      "rating": 4.8,
      "category": "Fiction",
      "tags": ["Philosophical", "Adventure"],
      "publisher": "HarperCollins",
      "yearOfPublishing": 1988
    },
    {
      "bookId": 9,
      "bookName": "The Road",
      "author": "Cormac McCarthy",
      "image": "https://i.ibb.co/CmS2Xbk/9.jpg",
      "review": "Cormac McCarthy's The Road is a haunting and deeply moving post-apocalyptic novel that explores the depths of human survival and love in a world stripped bare of civilization. Set in a desolate landscape ravaged by an unspecified cataclysm, the story follows a father and his young son as they journey southward in search of safety and salvation. Along the way, they face relentless hardships, encounter desperate survivors, and confront the bleak realities of a world consumed by darkness. Through McCarthy's spare and evocative prose, The Road paints a stark portrait of human resilience and the enduring power of love in the face of unimaginable adversity. With its profound themes and haunting imagery, the novel leaves a lasting impression on readers, prompting reflection on the fragility of life and the bonds that hold us together.",
      "totalPages": 287,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Dystopia", "Father-Son Relationship"],
      "publisher": "Alfred A. Knopf",
      "yearOfPublishing": 2006
    },
    {
      "bookId": 10,
      "bookName": "The Kite Runner",
      "author": "Khaled Hosseini",
      "image": "https://i.ibb.co/MZJ3HM1/10.jpg",
      "review": "Khaled Hosseini's The Kite Runner is a gripping tale of friendship, betrayal, and redemption set against the backdrop of Afghanistan's tumultuous history. The story follows Amir, a privileged Pashtun boy, and Hassan, his loyal Hazara servant, as they navigate the complexities of their relationship amidst the backdrop of political upheaval. After a tragic incident tears them apart, Amir embarks on a journey to atone for his past sins and find redemption in a war-torn land. Through Hosseini's evocative prose and poignant storytelling, The Kite Runner explores themes of guilt, forgiveness, and the enduring power of love. With its powerful narrative and unforgettable characters, the novel offers a vivid portrayal of the human spirit's capacity for both cruelty and compassion, leaving a profound impact on readers long after the final page.",
      "totalPages": 371,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Friendship", "Historical"],
      "publisher": "Riverhead Books",
      "yearOfPublishing": 2003
    }
  ]
  